# 개발 과정 요약 및 진행상황 정리

# vir_hoddy: book mark project_start
# 리눅스 환경과 mac os, window 상황 고려

# 가상공간 활성화(in pycharm)
# pycharm_activate: vir_test/Scripts/activate

#04.06
"""
git허브 내 보안 문제 오류 등을 상세히 검토 후 올리는 여부 검토!! 필요성 인지

"""


#04.07
"""
프로젝트 파일 및 설정
-allowed_host 설정
-애플리케이션 등록
-템플릿 설정
-데이터베이스 엔진 설정
-타임존 지정
-미디어 설정

기본 테이블 생성

슈퍼 유저 생성

애플리케이션 생성

애플리케이션 등록
"""


#4.08

"""
오늘 한 작업 내용 및 오류 발생 
admin 사이트에 테이블 반영 관련 시도 및 오류 발생 
데이터베이스 변경 사항 반영 

#bookmark pip 오류 발생 가상 환경 내 설치 오류 발생 및 해결 과정 점검
#pip install 오류 발생 

환경 변수 설정 및 고려 

#해결 방향 및 시도 방향 
pip 업그레이드
-오류 발생 및 리눅스 윈도우 터미널마다 명령어의 방향성이 조금씩 다름 확인
python -m pip install --upgrade pip 실행

파이썬 버전 다운그레이드 실행 및 점검 확인
"""

#4.09

"""
bookmark 모듈 현재 지원x의 문제로 다른 방향으로 우회 

프로젝트 재설정 및 설정 마무리 

프로젝트 구성요소 확인

어드민 페이지 확인

모델 적용 

모델 어드민 페이지 적용 
 
"""

#04.12
"""
#MTV 기본 개념 숙지 및 Template 작성

#diango view,url 체크

"""